"""
以下 # 注释标记的各个字Python典,列出了键值对应关系，即每个键都有一个值与之对应。 字符'#'后的内容是说明部分
"""
# 玩家ID字典
player_dict = {
    "全体玩家": -1, 
    "盖亚0": 0, 
    "玩家1": 1, 
    "玩家2": 2, 
    "玩家3": 3, 
    "玩家4": 4, 
    "玩家5": 5, 
    "玩家6": 6, 
    "玩家7": 7, 
    "玩家8": 8
}

# 模式字典
mode_dict = {
    "属性设置": 0,    # xsEffectAmount(0,单位ID,属性ID,设置属性值,作用玩家)
    "资源设置": 1,    # xsEffectAmount(1,待修改的资源ID,设置/加减标志位,设定值,作用玩家)
    "启用单位": 2,    # xsEffectAmount(2,要启用/禁用的单位,启用/禁用标志位,0,作用玩家)
    "单位升级": 3,    # xsEffectAmount(3,升级前的单位ID,升级后的单位 ID,0,作用玩家)
    "属性增加": 4,    # xsEffectAmount(4,单位ID,属性ID,增加属性值,作用玩家)
    "属性倍乘": 5,    # xsEffectAmount(5,单位ID,属性ID,倍乘属性值,作用玩家)
    "成本类型": 5,    # xsEffectAmount(5,单位ID,资源标志位,增删成本类型标志位,作用玩家)
    "资源倍乘": 6,    # xsEffectAmount(6,待修改的资源ID,设置/加减标志位,设定倍率,作用玩家)
    "产生单位": 7,    # xsEffectAmount(7,产生单位ID,产生建筑 ID,产生次数,作用玩家)
    "科技设置": 8,    # xsEffectAmount(8,科技ID,科技属性ID,属性数值,作用玩家)
    "文明名称": 9,    # xsEffectAmount(9,0,0,字符串表ID,作用玩家)
    "禁用科技":102,   # xsEffectAmount(102,待禁用的科技 ID,0,0,作用玩家)
}

# 建筑物字典
building_dict = {
    "房屋": 70, 
    "磨坊": 68, 
    "采矿场": 584, 
    "伐木场": 562, 
    "船坞": 45, 
    "巨港": 1189, 
    "农田": 50, 
    "废弃农田": 357, 
    "铁匠铺": 103, 
    "市场": 84, 
    "修道院": 104, 
    "强化教堂": -1, 
    "大学": 209, 
    "城镇中心": 109, 
    "世界奇观": 276, 
    "大商站": 1021, 
    "商队旅馆": 1754, 
    "贸易工厂": 110, 
    "贸易工厂-H": 1647, 
    "兵营": 12, 
    "靶场": 87, 
    "马厩": 101, 
    "攻城武器厂": 49, 
    "哨站": 598, 
    "木栅栏": 72, 
    "篱笆": 1062, 
    "石墙": 117, 
    "瞭望箭塔": 79, 
    "警戒箭塔": 234, 
    "大型箭塔": 235, 
    "炮塔": 236, 
    "城门-向上": 64, 
    "城门-向下": 88, 
    "城门-水平": 659, 
    "城门-垂直": 667, 
    "木城门-向上": 789, 
    "木城门-向下": 793, 
    "木城门-水平": 797, 
    "木城门-垂直": 801, 
    "城堡": 82, 
    "城楼": 1665, 
    "营垒": 1251, 

}

# 单位字典
unit_dict = {
#    "": , "": , "": ,
#    "": , "": , "": ,
    # 城镇中心
    "村民": 83, "村民（女）": 293, 
    "弗拉芒民兵": 1699, "弗拉芒民兵（男性）": 1663, "弗拉芒民兵（女性）": 1697, 
    # 市场
    "贸易车": 128, "贸易车（满）": 204, 
    # 兵营
    "民兵": 74, "剑士": 75, "长剑士": 77, "双手剑士": 473, "冠军剑士": 567, 
    "长矛兵": 93, "长枪兵": 358, "长戟兵": 359, 
    "鹰斥候": 751, "鹰勇士": 753, "精锐鹰勇士": 752, 
    "意大利佣兵": 882, "意大利佣兵-H": 184, 
    "近卫军": 41, "精锐近卫军": 555, "近卫军-H": 759, "精锐近卫军-H": 761, 
    # 靶场
    "步弓手": 4, "弩手": 24, "劲弩手": 492, 
    "掷矛手": 7, "精锐掷矛手": 6, "帝王掷矛手": 1155, 
    "骑射手": 39, "重装骑射手": 474, 
    "骑象射手": 873, "精锐骑象射手": 875, 
    "火枪手": 5, 
    "投石手": 185, 
    "标枪骑兵": 1010, "精锐标枪骑兵": 1012, 
    "标枪骑兵H": 583, "精锐标枪骑兵H": 596, 
    # 马厩
    "斥候骑兵": 448, "轻骑兵": 546, "翼骑兵": 441, 
    "骑士": 38, "重装骑士": 283, "游侠": 569, 
    "骆驼斥候": 1755, "骆驼兵": 329, "重装骆驼兵": 330, "帝王骆驼兵": 207, 
    "象兵": 1132, "精锐象兵": 1134, 
    "草原枪兵": 1370, "精锐草原枪兵": 1372, 
    "施里瓦姆沙骑手": 1751, "精锐施里瓦姆沙骑手": 1753, 
    # 攻城器械厂
    "轻型冲车": 1258, "轻型冲车-H": 35, "中型冲车": 422, "重型冲车": 548, 
    "轻型投石车": 280, "中型投石车": 550, "重型投石车": 588, 
    "弩炮": 279, "重型弩炮": 542, 
    "手推炮": 36, "榴弹炮": 1709, 
    "攻城塔": 1105, 
    # 城堡
    "爆破兵": 440, "破坏者": 440, 
    "巨型投石机": 42, "巨型投石机（组装）": 331, 
    # 修道院
    "僧侣": 125, "传教士": 775, 
    # 船坞
    "渔船": 13, "运输船": 545, "贸易船": 17, 
    "火艨艟": 1103, "喷火船": 529, "快速喷火船": 532, 
    "爆破筏": 1104, "爆破船": 527, "爆破船": 528, 
    "箭船": 539, "战舰": 21, "大型战舰": 442, 
    "炮舰": 420, "精锐炮舰": 691, 
}

# 属性字典
attr_dict = {
    "生命值": 0, 
    "视野": 1, 
    "驻扎容量": 2, 
    "碰撞体积X": 3, 
    "碰撞体积Y": 4, 
    "移动速度": 5, 
    "旋转速度": 6, 
    "护甲": 8, 
    "攻击": 9, 
    "攻击间隔": 10, 
    "命中率": 11, 
    "最大射程": 12, 
    "工作效率": 13, 
    "资源携带容量": 14, 
    "基础护甲": 15, 
    "主要抛掷物": 16, 
    "建筑图标": 17, 
    "地形防御奖励": 18, 
    "抛掷物智能模式": 19, 
    "最小射程": 20, 
    "第一资源存储": 21, 
    "践踏半径": 22, 
    "搜索半径": 23, 
    "额外伤害抗性": 24, 
    "单位图标": 25, 
    "第二资源存储": 26, 
    "第三资源存储": 27, 
    "迷雾可见性": 28, 
    "轮廓遮挡模式": 29, 
    "驻扎单位类型": 30, 
    "unknown": 31, 
    "碰撞体积Z": 32, 
    "清扫模式": 33, 
    "建筑建成地形": 34, 
    "英雄状态": 40, 
    "帧延迟": 41, 
    "训练场所": 42, 
    "训练按钮": 43, 
    "溅射攻击等级": 44, 
    "溅射防御等级": 45, 
    "显示攻击力": 46, 
    "显示最大射程": 47, 
    "显示近战护甲": 48, 
    "显示远程护甲": 49, 
    "物体名称ID": 50,    # 储存在语言文件中
    "物体描述ID": 51,    # 储存在语言文件中
    "限制地形ID": 53, 
    "单位特技": 54,  
    "特技配套单位": 56, 
    "死亡单位": 57, 
    "单位热键": 58, 
    "最大蓄力值": 59, 
    "蓄力再生率": 60, 
    "蓄力事件": 61, 
    "蓄力类型": 62, 
    "作战能力": 63, 
    "未命中偏离因子": 64, 
    "次要抛掷物": 65, 
    "血迹单位": 66, 
    "抛掷物命中模式": 67, 
    "抛掷物越障模式": 68, 
    "抛掷物角度": 69, 
    "攻击图像": 70, 
    "站立图像1": 71, 
    "站立图像2": 72, 
    "死亡图像": 73, 
    "亡灵图像": 74, 
    "移动图像1": 75, 
    "移动图像2": 76, 
    "特殊图像": 77, 
    "单位总成本": 100, 
    "训练时间": 101, 
    "抛掷物初始总数": 102, 
    "食物成本": 103, 
    "木材成本": 104, 
    "黄金成本": 105, 
    "石头成本": 106, 
    "抛掷物最大总数": 107, 
    "驻扎治疗速率": 108, 
    "自愈速率": 109, 
    "人口容量": 110, 
    "最小转化时间": 111, 
    "最大转化时间": 112, 
    "转化抗性": 113, 
    "编队类型": 114, 
    "溅射伤害比例": 115, 
}
